luobeihai/sdk-csp-apm32s1/debug/svd/APM32S103xx.svd
				<register>
					<name>CSTS</name>
					<displayName>CSTS</displayName>
					<description>Control/status register (RCM_CSTS)</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x0C000000</resetValue>
					<fields>
						<field>
							<name>LSIEN</name>
							<description>Internal low speed oscillator
enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSIRDYFLG</name>
							<description>Internal low speed oscillator ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTFLGCLR</name>
							<description>Remove reset flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NRSTFLG</name>
							<description>PIN reset flag</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PODRSTFLG</name>
							<description>POR/PDR reset flag</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWRSTFLG</name>
							<description>Software reset flag</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWDTRSTFLG</name>
							<description>Independent watchdog reset
flag</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WWDTRSTFLG</name>
							<description>Window watchdog reset flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPWRRSTFLG</name>
							<description>Low-power reset flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>DMA1</name>
			<description>DMA1 controller</description><groupName>DMA</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA1_Channel1</name>
				<description>DMA1 Channel1 global interrupt</description>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel2</name>
				<description>DMA1 Channel2 global interrupt</description>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel3</name>
				<description>DMA1 Channel3 global interrupt</description>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel4</name>
				<description>DMA1 Channel4 global interrupt</description>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel5</name>
				<description>DMA1 Channel5 global interrupt</description>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel6</name>
				<description>DMA1 Channel6 global interrupt</description>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>DMA1_Channel7</name>
				<description>DMA1 Channel7 global interrupt</description>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>INTSTS</name>
					<displayName>INTSTS</displayName>
					<description>DMA Interrupt status register     (DMA_INTSTS)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GINTFLG1</name>
							<description>Channel 1 Global interrupt
              flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG1</name>
							<description>Channel 1 Transfer Complete
              flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG1</name>
							<description>Channel 1 Half Transfer Complete
              flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG1</name>
							<description>Channel 1 Transfer Error
              flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG2</name>
							<description>Channel 2 Global interrupt
              flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG2</name>
							<description>Channel 2 Transfer Complete
              flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG2</name>
							<description>Channel 2 Half Transfer Complete
              flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG2</name>
							<description>Channel 2 Transfer Error
              flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG3</name>
							<description>Channel 3 Global interrupt
              flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG3</name>
							<description>Channel 3 Transfer Complete
              flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG3</name>
							<description>Channel 3 Half Transfer Complete
              flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG3</name>
							<description>Channel 3 Transfer Error
              flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG4</name>
							<description>Channel 4 Global interrupt
              flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG4</name>
							<description>Channel 4 Transfer Complete
              flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG4</name>
							<description>Channel 4 Half Transfer Complete
              flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG4</name>
							<description>Channel 4 Transfer Error
              flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG5</name>
							<description>Channel 5 Global interrupt
              flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG5</name>
							<description>Channel 5 Transfer Complete
              flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG5</name>
							<description>Channel 5 Half Transfer Complete
              flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG5</name>
							<description>Channel 5 Transfer Error
              flag</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG6</name>
							<description>Channel 6 Global interrupt
              flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG6</name>
							<description>Channel 6 Transfer Complete
              flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG6</name>
							<description>Channel 6 Half Transfer Complete
              flag</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG6</name>
							<description>Channel 6 Transfer Error
              flag</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTFLG7</name>
							<description>Channel 7 Global interrupt
              flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCFLG7</name>
							<description>Channel 7 Transfer Complete
              flag</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTFLG7</name>
							<description>Channel 7 Half Transfer Complete
              flag</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRFLG7</name>
							<description>Channel 7 Transfer Error
              flag</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTFCLR</name>
					<displayName>INTFCLR</displayName>
					<description>DMA Interrupt reset  register    (DMA_INTFCLR)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GINTCLR1</name>
							<description>Channel 1 Global interrupt
             resetr</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR2</name>
							<description>Channel 2 Global interrupt
              reset</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR3</name>
							<description>Channel 3 Global interrupt
              reset</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR4</name>
							<description>Channel 4 Global interrupt
              reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR5</name>
							<description>Channel 5 Global interrupt
              reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR6</name>
							<description>Channel 6 Global interrupt
              reset</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GINTCLR7</name>
							<description>Channel 7 Global interrupt
              reset</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR1</name>
							<description>Channel 1 Transfer Complete
              reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR2</name>
							<description>Channel 2 Transfer Complete
              reset</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR3</name>
							<description>Channel 3 Transfer Complete
              reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR4</name>
							<description>Channel 4 Transfer Complete
              reset</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR5</name>
							<description>Channel 5 Transfer Complete
              reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR6</name>
							<description>Channel 6 Transfer Complete
              reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCLR7</name>
							<description>Channel 7 Transfer Complete
              reset</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR1</name>
							<description>Channel 1 Half Transfer
              reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR2</name>
							<description>Channel 2 Half Transfer
              reset</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR3</name>
							<description>Channel 3 Half Transfer
              reset</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR4</name>
							<description>Channel 4 Half Transfer
              reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR5</name>
							<description>Channel 5 Half Transfer
              reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR6</name>
							<description>Channel 6 Half Transfer
              reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTCLR7</name>
							<description>Channel 7 Half Transfer
              reset</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR1</name>
							<description>Channel 1 Transfer Error
              reset</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR2</name>
							<description>Channel 2 Transfer Error
              reset</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR3</name>
							<description>Channel 3 Transfer Error
              reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR4</name>
							<description>Channel 4 Transfer Error
              reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR5</name>
							<description>Channel 5 Transfer Error
              reset</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR6</name>
							<description>Channel 6 Transfer Error
              reset</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRCLR7</name>
							<description>Channel 7 Transfer Error
              reset</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG1</name>
					<displayName>CHCFG1</displayName>
					<description>DMA channel 1 configuration register </description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHEN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCINTEN</name>
							<description>Transfer complete interrupt
              enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTINTEN</name>
							<description>Half Transfer interrupt
              enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TERRINTEN</name>
							<description>Transfer error interrupt
              enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIRCFG</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRMODE</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PERIMODE</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MIMODE</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PERSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MEMSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CHPL</name>
							<description>Channel Priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>M2MMODE</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHNDATA1</name>
					<displayName>CHNDATA1</displayName>
					<description>DMA channel 1 number of data register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NDATA</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPADDR1</name>
					<displayName>CHPADDR1</displayName>
					<description>DMA channel 1 peripheral address register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PERADDR</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHMADDR1</name>
					<displayName>CHMADDR1</displayName>
					<description>DMA channel 1 memory address
          register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MEMADDR</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG2</name><displayName>CHCFG2</displayName>
					
					<description>DMA channel 2 configuration register
					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>CHEN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth>
							
							
							
