luobeihai/sdk-csp-apm32s1/debug/svd/APM32S103xx.svd
			</registers>
		</peripheral><peripheral>
			<name>TMR1</name>
			<description>Advanced timer</description><groupName>TMR</groupName>
			<baseAddress>0x40012C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TMR1_BRK</name>
				<description>TMR1 Break interrupt</description>
				<value>24</value>
			</interrupt>
			<interrupt>
				<name>TMR1_UP</name>
				<description>TMR1 Update interrupt</description>
				<value>25</value>
			</interrupt>
			<interrupt>
				<name>TMR1_TRG_COM</name>
				<description>TMR1 Trigger</description>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>TMR1_CC</name>
				<description>TMR1 Capture Compare interrupt</description>
				<value>27</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CNTEN</name>
							<description>Counter enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>UD</name>
							<description>Update disable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>URSSEL</name>
							<description>Update request source</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SPMEN</name>
							<description>One-pulse mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CNTDIR</name>
							<description>Direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CAMSEL</name>
							<description>Center-aligned mode
selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>ARPEN</name>
							<description>Auto-reload preload enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CLKDIV</name>
							<description>Clock division</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>control register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCPEN</name>
							<description>Capture/compare preloaded
              control</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CCUSEL</name>
							<description>Capture/compare control update
              selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CCDSEL</name>
							<description>Capture/compare DMA
              selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MMSEL</name>
							<description>Master mode selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>TI1SEL</name>
							<description>TI1 selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC1OIS</name>
							<description>Output Idle state 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC1NOIS</name>
							<description>Output Idle state 1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC2OIS</name>
							<description>Output Idle state 2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC2NOIS</name>
							<description>Output Idle state 2</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC3OIS</name>
							<description>Output Idle state 3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC3NOIS</name>
							<description>Output Idle state 3</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC4OIS</name>
							<description>Output Idle state 4</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SMCTRL</name>
					<displayName>SMCTRL</displayName>
					<description>slave mode control register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SMFSEL</name>
							<description>Slave mode selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>TRGSEL</name>
							<description>Trigger selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>MSMEN</name>
							<description>Master/Slave mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ETFCFG</name>
							<description>External trigger filter</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>ETPCFG</name>
							<description>External trigger prescaler</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>ECEN</name>
							<description>External clock enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ETPOL</name>
							<description>External trigger polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEN</name>
					<displayName>DIEN</displayName>
					<description>DMA/Interrupt enable register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UIEN</name>
							<description>Update interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1IEN</name>
							<description>Capture/Compare 1 interrupt
              enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2IEN</name>
							<description>Capture/Compare 2 interrupt
              enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3IEN</name>
							<description>Capture/Compare 3 interrupt
              enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4IEN</name>
							<description>Capture/Compare 4 interrupt
              enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>COMIEN</name>
							<description>COM interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TRGIEN</name>
							<description>Trigger interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BRKIEN</name>
							<description>Break interrupt enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>UDIEN</name>
							<description>Update DMA request enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1DEN</name>
							<description>Capture/Compare 1 DMA request
              enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2DEN</name>
							<description>Capture/Compare 2 DMA request
              enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3DEN</name>
							<description>Capture/Compare 3 DMA request
              enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4DEN</name>
							<description>Capture/Compare 4 DMA request
              enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>COMDEN</name>
							<description>COM DMA request enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TRGDEN</name>
							<description>Trigger DMA request enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>status register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UIFLG</name>
							<description>Update interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1IFLG</name>
							<description>Capture/compare 1 interrupt
              flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2IFLG</name>
							<description>Capture/Compare 2 interrupt
              flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3IFLG</name>
							<description>Capture/Compare 3 interrupt
              flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4IFLG</name>
							<description>Capture/Compare 4 interrupt
              flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>COMIFLG</name>
							<description>COM interrupt flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TIFLG</name>
							<description>Trigger interrupt flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BRKIFLG</name>
							<description>Break interrupt flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1RCFLG</name>
							<description>Capture/Compare 1 overcapture
              flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2RCFLG</name>
							<description>Capture/compare 2 overcapture
              flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3RCFLG</name>
							<description>Capture/Compare 3 overcapture
              flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4RCFLG</name>
							<description>Capture/Compare 4 overcapture
              flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CEG</name>
					<displayName>CEG</displayName>
					<description>event generation register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEG</name>
							<description>Update generation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1EG</name>
							<description>Capture/compare 1
              generation</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2EG</name>
							<description>Capture/compare 2
              generation</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3EG</name>
							<description>Capture/compare 3
              generation</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4EG</name>
							<description>Capture/compare 4
              generation</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>COMG</name>
							<description>Capture/Compare control update
              generation</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TEG</name>
							<description>Trigger generation</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BEG</name>
							<description>Break generation</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCM1</name>
					<displayName>CCM1_COMPARE</displayName>
					<description>capture/compare mode register 1 (Compare mode)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CC1SEL</name>
							<description>Capture/Compare 1 selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>OC1FEN</name>
							<description>Output Compare 1 fast enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC1PEN</name>
							<description>Output Compare 1 preload enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC1MOD</name>
							<description>Output Compare 1 mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>OC1CEN</name>
							<description>Output Compare 1 clear enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2SEL</name>
							<description>Capture/Compare 2 selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>OC2FEN</name>
							<description>Output Compare 2 fast enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC2PEN</name>
							<description>Output Compare 2 preload enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC2MOD</name>
							<description>Output Compare 2 mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>OC2CEN</name>
							<description>Output Compare 2 clear enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCM1_CAPTURE</name>
					<displayName>CCM1_CAPTURE</displayName>
					<description>capture/compare mode register 1 (Capture mode)</description>
					<alternateRegister>CCM1</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CC1SEL</name>
							<description>Capture/Compare 1 selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC1PSC</name>
							<description>Input capture 1 prescaler</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC1F</name>
							<description>Input capture 1 filter</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>CC2SEL</name>
							<description>Capture/Compare 2 selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC2PSC</name>
							<description>Input capture 2 prescaler</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC2F</name>
							<description>Input capture 2 filter</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCM2</name>
					<displayName>CCM2_COMPARE</displayName>
					<description>capture/compare mode register 2 (Compare mode)</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CC3SEL</name>
							<description>Capture/Compare 3 selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>OC3FEN</name>
							<description>Output compare 3 fast enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC3PEN</name>
							<description>Output compare 3 preload enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC3MOD</name>
							<description>Output compare 3 mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>OC3CEN</name>
							<description>Output compare 3 clear enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4SEL</name>
							<description>Capture/Compare 4 selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>OC4FEN</name>
							<description>Output compare 4 fast enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC4PEN</name>
							<description>Output compare 4 preload enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OC4MOD</name>
							<description>Output compare 4 mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>OC4CEN</name>
							<description>Output compare 4 clear enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCM2_CAPTURE</name>
					<displayName>CCM2_CAPTURE</displayName>
					<description>capture/compare mode register 2 (Capture mode)</description>
					<alternateRegister>CCM2</alternateRegister>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CC3SEL</name>
							<description>Capture/compare 3
              selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC3PSC</name>
							<description>Input capture 3 prescaler</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC3F</name>
							<description>Input capture 3 filter</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>CC4SEL</name>
							<description>Capture/Compare 4
              selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC4PSC</name>
							<description>Input capture 4 prescaler</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>IC4F</name>
							<description>Input capture 4 filter</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCEN</name>
					<displayName>CCEN</displayName>
					<description>capture/compare enable
          register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1EN</name>
							<description>Capture/Compare 1 output
              enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1POL</name>
							<description>Capture/Compare 1 output
              Polarity</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1NEN</name>
							<description>Capture/Compare 1 complementary output
              enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC1NPOL</name>
							<description>Capture/Compare 1 output
              Polarity</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2EN</name>
							<description>Capture/Compare 2 output
              enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2POL</name>
							<description>Capture/Compare 2 output
              Polarity</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2NEN</name>
							<description>Capture/Compare 2 complementary output
              enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC2NPOL</name>
							<description>Capture/Compare 2 output
              Polarity</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3EN</name>
							<description>Capture/Compare 3 output
              enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3POL</name>
							<description>Capture/Compare 3 output
              Polarity</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3NEN</name>
							<description>Capture/Compare 3 complementary output
              enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC3NPOL</name>
							<description>Capture/Compare 3 output
              Polarity</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4EN</name>
							<description>Capture/Compare 4 output
              enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CC4POL</name>
							<description>Capture/Compare 3 output
              Polarity</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
