luobeihai/sdk-csp-apm32s1/debug/svd/APM32S103xx.svd
			</registers>
		</peripheral><peripheral>
			<name>ADC1</name>
			<description>Analog to digital converter</description><groupName>ADC</groupName>
			<baseAddress>0x40012400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC1_2</name>
				<description>ADC1 global interrupt</description>
				<value>18</value>
			</interrupt>
			<registers><register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDFLG</name>
							<description>Analog watchdog flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EOCFLG</name>
							<description>Regular channel end of
              conversion</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJEOCFLG</name>
							<description>Injected channel end of
              conversion</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJCSFLG</name>
							<description>Injected channel start
              flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>REGCSFLG</name>
							<description>Regular channel start flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>control register 1</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDCHSEL</name>
							<description>Analog watchdog channel select
              bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>EOCIEN</name>
							<description>Interrupt enable for EOC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>AWDIEN</name>
							<description>Analog watchdog interrupt
              enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJEOCIEN</name>
							<description>Interrupt enable for injected
              channels</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SCANEN</name>
							<description>Scan mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>AWDSGLEN</name>
							<description>Enable the watchdog on a single channel
              in scan mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJGACEN</name>
							<description>Automatic injected group
              conversion</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>REGDISCEN</name>
							<description>Discontinuous mode on regular
              channels</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJDISCEN</name>
							<description>Discontinuous mode on injected
              channels</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DISCNUMCFG</name>
							<description>Discontinuous mode channel
              count</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>DUALMCFG</name>
							<description>Dual mode selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>INJAWDEN</name>
							<description>Analog watchdog enable on injected
              channels</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>REGAWDEN</name>
							<description>Analog watchdog enable on regular
              channels</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>control register 2</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADCEN</name>
							<description>A/D converter ON / OFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CONTCEN</name>
							<description>Continuous conversion</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CAL</name>
							<description>A/D calibration</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CALRST</name>
							<description>Reset calibration</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DMAEN</name>
							<description>Direct memory access mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DALIGNCFG</name>
							<description>Data alignment</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJGEXTTRGSEL</name>
							<description>External event select for injected
              group</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>INJEXTTRGEN</name>
							<description>External trigger conversion mode for
              injected channels</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>REGEXTTRGSEL</name>
							<description>External event select for regular
              group</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>REGEXTTRGEN</name>
							<description>External trigger conversion mode for
              regular channels</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>INJSWSC</name>
							<description>Start conversion of injected
              channels</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>REGSWSC</name>
							<description>Start conversion of regular
              channels</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TSVREFEN</name>
							<description>Temperature sensor and VREFINT
              enable</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SMPTIM1</name>
					<displayName>SMPTIM1</displayName>
					<description>sample time register 1</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SMPCYCCFG10</name>
							<description>Channel 10 sample time
              selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG11</name>
							<description>Channel 11 sample time
              selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG12</name>
							<description>Channel 12 sample time
              selection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG13</name>
							<description>Channel 13 sample time
              selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG14</name>
							<description>Channel 14 sample time
              selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG15</name>
							<description>Channel 15 sample time
              selection</description>
							<bitOffset>15</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG16</name>
							<description>Channel 16 sample time
              selection</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG17</name>
							<description>Channel 17 sample time
              selection</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SMPTIM2</name>
					<displayName>SMPTIM2</displayName>
					<description>sample time register 2</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SMPCYCCFG0</name>
							<description>Channel 0 sample time
              selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG1</name>
							<description>Channel 1 sample time
              selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG2</name>
							<description>Channel 2 sample time
              selection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG3</name>
							<description>Channel 3 sample time
              selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG4</name>
							<description>Channel 4 sample time
              selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG5</name>
							<description>Channel 5 sample time
              selection</description>
							<bitOffset>15</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG6</name>
							<description>Channel 6 sample time
              selection</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG7</name>
							<description>Channel 7 sample time
              selection</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG8</name>
							<description>Channel 8 sample time
              selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMPCYCCFG9</name>
							<description>Channel 9 sample time
              selection</description>
							<bitOffset>27</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDOF1</name>
					<displayName>INJDOF1</displayName>
					<description>injected channel data offset register 1</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDOF1</name>
							<description>Data offset for injected channel 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDOF2</name>
					<displayName>INJDOF2</displayName>
					<description>injected channel data offset register 2</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDOF2</name>
							<description>Data offset for injected channel 2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDOF3</name>
					<displayName>INJDOF3</displayName>
					<description>injected channel data offset register 3</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDOF3</name>
							<description>Data offset for injected channel 3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDOF4</name>
					<displayName>INJDOF4</displayName>
					<description>injected channel data offset register 4</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDOF4</name>
							<description>Data offset for injected channel 4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>AWDHT</name>
					<displayName>AWDHT</displayName>
					<description>watchdog higher threshold
          register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>AWDHT</name>
							<description>Analog watchdog higher
              threshold</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>AWDLT</name>
					<displayName>AWDLT</displayName>
					<description>watchdog lower threshold
          register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDLT</name>
							<description>Analog watchdog lower
              threshold</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>REGSEQ1</name>
					<displayName>REGSEQ1</displayName>
					<description>regular sequence register 1</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REGSEQC13</name>
							<description>13th conversion in regular
              sequence</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>REGSEQC14</name>
							<description>14th conversion in regular
              sequence</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>REGSEQC15</name>
							<description>15th conversion in regular
              sequence</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>REGSEQC16</name>
							<description>16th conversion in regular
              sequence</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>REGSEQLEN</name>
							<description>Regular channel sequence
              length</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>REGSEQ2</name>
					<displayName>REGSEQ2</displayName>
					<description>regular sequence register 2</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REGSEQC12</name>
							<description>12th conversion in regular
              sequence</description>
							<bitOffset>25</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC11</name>
							<description>11th conversion in regular
              sequence</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC10</name>
							<description>10th conversion in regular
              sequence</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC9</name>
							<description>9th conversion in regular
              sequence</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC8</name>
							<description>8th conversion in regular
              sequence</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC7</name>
							<description>7th conversion in regular
              sequence</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>REGSEQ3</name>
					<displayName>REGSEQ3</displayName>
					<description>regular sequence register 3</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REGSEQC6</name>
							<description>6th conversion in regular
              sequence</description>
							<bitOffset>25</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC5</name>
							<description>5th conversion in regular
              sequence</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC4</name>
							<description>4th conversion in regular
              sequence</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC3</name>
							<description>3rd conversion in regular
              sequence</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC2</name>
							<description>2nd conversion in regular
              sequence</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>REGSEQC1</name>
							<description>1st conversion in regular
              sequence</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJSEQ</name>
					<displayName>INJSEQ</displayName>
					<description>injected sequence register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJSEQLEN</name>
							<description>Injected sequence length</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INJSEQC4</name>
							<description>4th conversion in injected
              sequence</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>INJSEQC3</name>
							<description>3rd conversion in injected
              sequence</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>INJSEQC2</name>
							<description>2nd conversion in injected
              sequence</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>INJSEQC1</name>
							<description>1st conversion in injected
              sequence</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDATA1</name>
					<displayName>INJDATA1</displayName>
					<description>injected data register 1</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDATA2</name>
					<displayName>INJDATA2</displayName>
					<description>injected data register 2</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDATA3</name>
					<displayName>INJDATA3</displayName>
					<description>injected data register 3</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INJDATA4</name>
					<displayName>INJDATA4</displayName>
					<description>injected data register 4</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INJDATA</name>
							<description>Injected data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>REGDATA</name>
					<displayName>REGDATA</displayName>
					<description>regular data register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REGDATA</name>
							<description>Regular data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>ADC2DATA</name>
							<description>ADC2 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register></registers>
		</peripheral><peripheral>
			<name>ADC2</name>
			<description>Analog to digital converter</description><groupName>ADC</groupName>
			<baseAddress>0x40012800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC1_2</name>
				<description>ADC2 global interrupt</description>
				<value>18</value>
			</interrupt>
			<registers><register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDFLG</name>
							<description>Analog watchdog flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EOCFLG</name>
							<description>Regular channel end of
              conversion</description>
