luobeihai/sdk-csp-apm32s1/debug/svd/APM32S103xx.svd
			</registers>
		</peripheral><peripheral derivedFrom="I2C1">
			<name>I2C2</name><description>Inter integrated circuit 2</description>
			<baseAddress>0x40005800</baseAddress><addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C2_EV</name>
				<description>I2C2 event interrupt</description>
				<value>33</value>
			</interrupt>
			<interrupt>
				<name>I2C2_ER</name>
				<description>I2C2 error interrupt</description>
				<value>34</value>
			</interrupt>
		</peripheral><peripheral derivedFrom="USART1">
			<name>USART3</name>
			<baseAddress>0x40004800</baseAddress>
			<interrupt>
				<name>USART3</name>
				<description>USART3 global interrupt</description>
				<value>39</value>
			</interrupt>
		</peripheral><peripheral derivedFrom="USART1">
			<name>USART2</name>
			<baseAddress>0x40004400</baseAddress>
			<interrupt>
				<name>USART2</name>
				<description>USART2 global interrupt</description>
				<value>38</value>
			</interrupt>
		</peripheral><peripheral>
			<name>IWDT</name>
			<description>Independent watchdog</description><groupName>IWDT</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KEY</name>
					<displayName>KEY</displayName>
					<description>Key register (IWDT_KEY)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<description>Key value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>Frequency Divider register (IWDT_PSC)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>Prescaler divider</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTRLD</name>
					<displayName>CNTRLD</displayName>
					<description>Reload values register (IWDT_CNTRLD)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>CNTRLD</name>
							<description>Watchdog counter reload
              value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>Status register (IWDT_STS)</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSCUFLG</name>
							<description>Watchdog prescaler value
update</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNTUFLG</name>
							<description>Watchdog counter reload value
update</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>WWDT</name>
			<description>Window watchdog</description><groupName>WWDT</groupName>
			<baseAddress>0x40002C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WWDT</name>
				<description>Window Watchdog interrupt</description>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<displayName>CTRL</displayName>
					<description>Control register (WWDT_CTRL)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>7-bit counter (MSB to LSB)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>WWDTEN</name>
							<description>Activation bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>Configuration register
          (WWDT_CFG)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000007F</resetValue>
					<fields>
						<field>
							<name>WIN</name>
							<description>7-bit window value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>TBPSC</name>
							<description>Timer Base</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EWIEN</name>
							<description>Early Wakeup Interrupt</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>Status register (WWDT_STS)</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EWIFLG</name>
							<description>Early Wakeup Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>RTC</name>
			<description>Real time clock</description><groupName>RTC</groupName>
			<baseAddress>0x40002800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<description>RTC global interrupt</description>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>RTCAlarm</name>
				<description>RTC Alarms through EXTI line interrupt</description>
				<value>41</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<displayName>CTRL</displayName>
					<description>Control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SECIEN</name>
							<description>Second interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ALRIEN</name>
							<description>Alarm interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVRIEN</name>
							<description>Overflow interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSTS</name>
					<displayName>CSTS</displayName>
					<description>Control and State register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000020</resetValue>
					<fields>
						<field>
							<name>SECFLG</name>
							<description>Second Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALRFLG</name>
							<description>Alarm Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVRFLG</name>
							<description>Overflow Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSYNCFLG</name>
							<description>Registers Synchronized
              Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFGMFLG</name>
							<description>Configuration Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OCFLG</name>
							<description>RTC operation OFF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSCRLDH</name>
					<displayName>PSCRLDH</displayName>
					<description>RTC predivision loading register High Bit</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSCRLDH</name>
							<description>RTC Prescaler Load Register
              High</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSCRLDL</name>
					<displayName>PSCRLDL</displayName>
					<description>RTC predivision loading register Low Bit</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x8000</resetValue>
					<fields>
						<field>
							<name>PSCRLDL</name>
							<description>RTC Prescaler Divider Register
              Low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSCH</name>
					<displayName>PSCH</displayName>
					<description>RTC predivider remainder register High Bit</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSCH</name>
							<description>RTC prescaler divider register
              high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSCL</name>
					<displayName>PSCL</displayName>
					<description>RTC predivider remainder register Low Bit</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x8000</resetValue>
					<fields>
						<field>
							<name>PSCL</name>
							<description>RTC prescaler divider register
              Low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTH</name>
					<displayName>CNTH</displayName>
					<description>RTC count register High Bit</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTH</name>
							<description>RTC counter register high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTL</name>
					<displayName>CNTL</displayName>
					<description>RTC count register Low Bit</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTL</name>
							<description>RTC counter register Low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ALRH</name>
					<displayName>ALRH</displayName>
					<description>RTC alarm clock register High Bit</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<name>ALRH</name>
							<description>RTC alarm register high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ALRL</name>
					<displayName>ALRL</displayName>
					<description>RTC alarm clock register Low Bit</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<name>ALRL</name>
							<description>RTC alarm register low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
