luobeihai/sdk-csp-apm32s1/debug/svd/APM32S103xx.svd
			</registers>
		</peripheral><peripheral>
			<name>DBGMCU</name>
			<description>Debug support</description><groupName>DBGMCU</groupName>
			<baseAddress>0xE0042000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>DBGMCU_IDCODE</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EQR</name>
							<description>Equipment Recognition</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>WVR</name>
							<description>Wafer Version Recognition</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>DBGMCU_CFG</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SLEEP_CLK_STS</name>
							<description>SLEEP_CLK_STS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOP_CLK_STS</name>
							<description>STOP_CLK_STS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STANDBY_CLK_STS</name>
							<description>STANDBY_CLK_STS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRACE_IOEN</name>
							<description>TRACE_IOEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRACE_MODE</name>
							<description>TRACE_MODE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IWDT_STS</name>
							<description>IWDT_STS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDT_STS</name>
							<description>WWDT_STS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR1_STS</name>
							<description>TMR1_STS</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR2_STS</name>
							<description>TMR2_STS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR3_STS</name>
							<description>TMR3_STS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR4_STS</name>
							<description>TMR4_STS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAN1_STS</name>
							<description>CAN1_STS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1_SMBUS_TIMEOUT_STS</name>
							<description>I2C1_SMBUS_TIMEOUT_STS</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2_SMBUS_TIMEOUT_STS</name>
							<description>I2C2_SMBUS_TIMEOUT_STS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						
						
						
						
						<field>
							<name>CAN2_STS</name>
							<description>CAN2_STS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>QSPI</name>
			<description>Serial peripheral interface</description><groupName>QSPI</groupName>
			
			<alternatePeripheral/><baseAddress>0xA0000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock><interrupt>
				<name>QSPI</name>
				<description>QSPI interrupt</description>
				<value>44</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x4007</resetValue>
					<fields>
						<field>
							<name>DFS</name><description>DFS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>CPHA</name><description>CPHA</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CPOL</name><description>CPOL</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXMODE</name><description>TXMODE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>SSTEN</name>
							<description>SSTEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FRF</name><description>FRF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>NDF</name>
							<description>NDF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SSIEN</name>
					<displayName>SSIEN</displayName>
					<description>QSPI Enable register  </description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SLAEN</name>
					<displayName>SLAEN</displayName>
					<description>QSPI Slave enable register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SLAEN</name>
							<description>SLAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>BR</name>
					<displayName>BR</displayName>
					<description>Baudrate register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>CLKDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>TFTL</name>
					<displayName>TFTL</displayName>
					<description>Transmission FIFO threshhold level register </description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFT</name>
							<description>TFT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field><field>
							<name>TFTH</name>
							<description>TFTH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RFTL</name>
					<displayName>RFTL</displayName>
					<description>Reception FIFO threshhold level register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFT</name>
							<description>RFT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>TFL</name>
					<displayName>TFL</displayName>
					<description>Transmission FIFO level register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFL</name>
							<description>TFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RFL</name>
					<displayName>RFL</displayName>
					<description>Reception FIFO level register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFL</name>
							<description>RFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>Status register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x0006</resetValue>
					<fields>
						<field>
							<name>BUSYF</name>
							<description>BUSYF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFNF</name>
							<description>TFNF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFEF</name>
							<description>TFEF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFNEF</name>
							<description>RFNEF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFF</name>
							<description>RFFF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DCEF</name>
							<description>DCEF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INTEN</name>
					<displayName>INTEN</displayName>
					<description>Interrupt enable register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size><access>read-write</access>
					<resetValue>0x007F</resetValue>
					<fields>
						<field>
							<name>TFEIE</name>
							<description>TFEIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFOIE</name>
							<description>TFOIE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFUIE</name>
							<description>RFUIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFOIE</name>
							<description>RFOIE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFIE</name>
							<description>RFFIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MSTIE</name>
							<description>MSTIE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>ISTS</name>
					<displayName>ISTS</displayName>
					<description>Interrupt status register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFEIF</name>
							<description>TFEIF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFOIF</name>
							<description>TFOIF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFUIF</name>
							<description>RFUIF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFOIF</name>
							<description>RFOIF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFIF</name>
							<description>RFFIF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MSTIF</name>
							<description>MSTIF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RIS</name>
					<displayName>RIS</displayName>
					<description>Raw interrupt register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFEIF</name>
							<description>TFEIF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFOIF</name>
							<description>TFOIF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFUIF</name>
							<description>RFUIF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXOIR</name>
							<description>RXOIR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RXFIR</name>
							<description>RXFIR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MSTIR</name>
							<description>MSTIR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>TFOIC</name>
					<displayName>TFOIC</displayName>
					<description>Transmission FIFO overflow interrupt clear register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFOIC</name>
							<description>TFOIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RFOIC</name>
					<displayName>RFOIC</displayName>
					<description>Reception FIFO overflow interrupt clear register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFOIC</name>
							<description>RFOIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RFUIC</name>
					<displayName>RFUIC</displayName>
					<description>Reception FIFO underflow interrupt clear register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFUIC</name>
							<description>RFUIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>MIC</name>
					<displayName>MIC</displayName>
					<description>Master interrupt clear register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>MIC</name>
							<description>MIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>ICF</name>
					<displayName>ICF</displayName>
					<description>Interrupt clear register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ICF</name>
							<description>ICF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>DATA</name>
					<displayName>DATA</displayName>
					<description>data register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RSD</name>
					<displayName>RSD</displayName>
					<description>Reception sample register</description>
					<addressOffset>0xF0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RSD</name>
							<description>RSD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>RSE</name>
							<description>RSE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL3</name>
					<displayName>CTRL3</displayName>
					<description>Control register 3</description>
					<addressOffset>0xF4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IAT</name>
							<description>IAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>ADDRLEN</name>
							<description>ADDRLEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>INSLEN</name>
							<description>INSLEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>WAITCYC</name>
							<description>WAITCYC</description>
							<bitOffset>11</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>CSEN</name>
							<description>CSEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOSW</name>
					<displayName>IOSW</displayName>
					<description>IO switch register</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IOSW</name>
							<description>I/O switch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
